#### NoPhysicalElementsLeftInExistingRelationship Property

---

|  |
| --- |
| BuiltInFailures AnalyticalModelFailures Class   See Also |

There are no Physical elements left in the existing relationship.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoPhysicalElementsLeftInExistingRelationship { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoPhysicalElementsLeftInExistingRelationship As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoPhysicalElementsLeftInExistingRelationship { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AnalyticalModelFailures Class

Autodesk.Revit.DB Namespace